Tekla Open API Reference for Tekla Structures 2025
Parallel.VectorToVector Method (Vector, Vector, Double)
 Returns true if the given vectors are parallel within the given angular tolerance.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool VectorToVector(
	Vector Vector1,
	Vector Vector2,
	double Tolerance
)
Public Shared Function VectorToVector (
	Vector1 As Vector,
	Vector2 As Vector,
	Tolerance As Double
) As Boolean
Parameters
Vector1
Type: Tekla.Structures.Geometry3d.Vector
The first vector to be used.
Vector2
Type: Tekla.Structures.Geometry3d.Vector
The second vector to be used.
Tolerance
Type: System.Double
The angular tolerance (in radians) to be used.
Return Value
Type: Boolean
True if the given vectors are parallel within the given tolerance.
See Also
Reference
Parallel Class
VectorToVector Overload
Tekla.Structures.Geometry3d Namespace